# **ML: Credit Card Transactions**

### Importing Liabraries

In [2]:
import pandas as pd

In [3]:
cc_info=pd.read_csv("../data/cc_info.csv",index_col=None)
cc_info.head()

    credit_card      city state  zipcode  credit_card_limit
0  1.280981e+15    Dallas    PA    18612               6000
1  9.737220e+15   Houston    PA    15342              16000
2  4.749889e+15    Auburn    MA     1501              14000
3  9.591504e+15   Orlando    WV    26412              18000
4  2.095640e+15  New York    NY    10001              20000

In [4]:
transactions=pd.read_csv("../data/transactions.csv",index_col=None)
transactions.head()

,credit_card,date,transaction_dollar_amount,Long,Lat
0,1.003715e+15,2015-09-11 00:32:40,43.78,-80.174132,40.267370
1,1.003715e+15,2015-10-24 22:23:08,103.15,-80.194240,40.180114
2,1.003715e+15,2015-10-26 18:19:36,48.55,-80.211033,40.313004
3,1.003715e+15,2015-10-22 19:41:10,136.18,-80.174138,40.290895
4,1.003715e+15,2015-10-26 20:08:22,71.82,-80.238720,40.166719